{"user_id": "8842281e1d1347389f2ab93d60773d4d", "timestamp": "2017-08-30", "review_sentences": [[0, "This is a special book."], [0, "It started slow for about the first third, then in the middle third it started to get interesting, then the last third blew my mind."], [0, "This is what I love about good science fiction - it pushes your thinking about where things can go."], [0, "It is a 2015 Hugo winner, and translated from its original Chinese, which made it interesting in just a different way from most things I've read."], [0, "For instance the intermixing of Chinese revolutionary history - how they kept accusing people of being \"reactionaries\", etc."], [0, "It is a book about science, and aliens."], [0, "The science described in the book is impressive - its a book grounded in physics and pretty accurate as far as I could tell."], [1, "Though when it got to folding protons into 8 dimensions I think he was just making stuff up - interesting to think about though."], [1, "But what would happen if our SETI stations received a message - if we found someone was out there - and the person monitoring and answering the signal on our side was disillusioned?"], [1, "That part of the book was a bit dark - I would like to think human reaction to discovering alien civilization that is hostile would be more like Enders Game where we would band together."], [1, "I did like how the book unveiled the Trisolaran culture through the game."], [1, "It was a smart way to build empathy with them and also understand what they've gone through across so many centuries."], [1, "And who know a 3 body problem was an unsolvable math problem?"], [1, "But I still don't get who made the game - maybe that will come in the next book."], [1, "I loved this quote:"], [1, "\"In the long history of scientific progress, how many protons have been smashed apart in accelerators by physicists?"], [1, "How many neutrons and electrons?"], [1, "Probably no fewer than a hundred million."], [1, "Every collision was probably the end of the civilizations and intelligences in a microcosmos."], [1, "In fact, even in nature, the destruction of universes must be happening at every second--for example, through the decay of neutrons."], [1, "Also, a high-energy cosmic ray entering the atmosphere may destroy thousands of such miniature universes....\""]], "rating": 5, "has_spoiler": true, "book_id": "18245960", "review_id": "dfdbb7b0eb5a7e4c26d59a937e2e5feb"}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "timestamp": "2017-03-22", "review_sentences": [[0, "Recommended by Don Katz."], [0, "Avail for free in December: http://www.audible.com/mt/ellison2?so..."]], "rating": 3, "has_spoiler": false, "book_id": "16981", "review_id": "a5d2c3628987712d0e05c4f90798eb67"}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "timestamp": "2017-03-20", "review_sentences": [[0, "A fun, fast paced science fiction thriller."], [0, "I read it in 2 nights and couldn't put it down."], [0, "The book is about the quantum theory of many worlds which states that all decisions we make throughout our lives basically create branches, and that each possible path through the decision tree can be thought of as a parallel world."], [0, "And in this book, someone invents a way to switch between these worlds."], [0, "This was nicely alluded to/foreshadowed in this quote:"], [0, "\"I think about all the choices we've made that created this moment."], [0, "Us sitting here together at this beautiful table."], [0, "Then I think of all the possible events that could have stopped this moment from ever happening, and it all feels, I don't know...\" \"What?\""], [0, "\"So fragile.\""], [0, "Now he becomes thoughtful for a moment."], [0, "He says finally, \"It's terrifying when you consider that every thought we have, every choice we could possibly make, branches into a new world.\""], [1, "This book can't be discussed without spoilers."], [1, "It is a book about choice and regret."], [1, "Ever regret not chasing the girl of your dreams so you can focus on your career?"], [1, "Well Jason2 made that choice and then did regret it."], [1, "Clearly the author is trying to tell us to optimize for happiness - to be that second rate physics teacher at a community college if it means you can have a happy life."], [1, "I'm being snarky because while there is certainly something to that, you also have to have meaning in your life that comes from within."], [1, "I thought the book was a little shallow on this dimension."], [1, "In fact, all the characters were fairly shallow."], [1, "Daniela was the perfect wife."], [1, "Ryan the perfect antithesis of Jason."], [1, "Amanda the perfect loyal traveling companion, etc."], [1, "This, plus the fact that the book was weak on the science are what led me to take a few stars off - but I'd still read it again if I could go back in time - was a very fun and engaging read."], [1, "If you want to really minimize regret, you have to live your life to avoid it in the first place."], [1, "Regret can't be hacked, which is kind of the point of the book."], [1, "My favorite book about regret is Remains of the Day."], [1, "I do really like the visualization of the decision tree though - that is a powerful concept."], [1, "\"Every moment, every breath, contains a choice."], [1, "But life is imperfect."], [1, "We make the wrong choices."], [1, "So we end up living in a state of perpetual regret, and is there anything worse?"], [1, "I built something that could actually eradicate regret."], [1, "Let you find worlds where you made the right choice.\""], [1, "Daniela says, \"Life doesn't work that way."], [1, "You live with your choices and learn."], [1, "You don't cheat the system.\""]], "rating": 3, "has_spoiler": true, "book_id": "28684704", "review_id": "2ede853b14dc4583f96cf5d120af636f"}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "timestamp": "2016-11-09", "review_sentences": [[0, "Recommended reading to understand what is going on in middle america, and possibly better explain why Trump won."], [0, "http://www.npr.org/2016/11/09/5013826..."]], "rating": 0, "has_spoiler": false, "book_id": "27161156", "review_id": "ced5675e55cd9d38a524743f5c40996e"}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "timestamp": "2016-04-25", "review_sentences": [[0, "I really enjoyed this book, and there is a lot to recommend it."], [0, "It did drag on a little at the end so I knocked off 1 star - but overall a wow book."], [0, "It's the story of a starship sent to Tau Ceti - the nearest star that has Earth analog planets - to colonize it."], [0, "The journey there will take generations, and the story is told of the 3rd & 4th (?)"], [0, "generations, which are the ones that reaches Tau Ceti."], [0, "It is a story of purpose, and how having a purpose affects behavior."], [0, "A story of politics, and people."], [0, "The first cool thing about this book is the richness of its world."], [0, "The ship is intricate and large in its design and ambition to shepherd ~1200 people for that much time."], [0, "It had 3D printers that can print almost anything you can imagine - even DNA - or more printers - so little goes lacking that can't be recreated."], [0, "But the thing that makes this book brilliant is the Ship."], [0, "The AI that controls the ship, who is narrating the book by the end."], [0, "It's observations about humans and our language are just brilliant."], [0, "It starts with the astute observation that human language is very imprecise, and relies heavily on metaphor and analogy."], [0, "It is remarkable once you start to reflect on it, how true that is."], [0, "To hear the AI reflect on this:"], [0, "\"Perhaps there is a provisional solution to this epistemological mess, which is to be located in the phrase \"it is as if\"."], [0, "This phrase is of course precisely the announcement of an analogy."], [0, "And on reflection, it is admittedly a halting problem, but jumping out of it, there is something quite suggestive and powerful in this formulation, something very specifically human."], [0, "Possibly this formulation itself is the deep diagnostic of all human cognition--the tell, as they say, meaning the thing that tells, the giveaway."], [0, "In the infinite black space of ignorance, it is as if stands as the basic operation of cognition, the mark perhaps of consciousness itself."], [0, "Human language: it is as if it made sense.\""], [0, "Basically we are a bunch of pattern matchers, trying to match things we've seen before to new things, and if they don't match perfectly, it doesn't matter, because matching helps us bucket and organize the new information."], [0, "But this is incredibly fuzzy!"], [0, "The AI also makes hilarious observations like this:"], [0, "Indeed, it has to be said that the percentage of old human sayings and proverbs that are actually true is very far from 100 percent."], [0, "Seems it may be less important that it be true than that it rhyme, or show alliteration or the like."], [0, "What goes around comes around: really?"], [0, "What does this mean?\""], [0, "Or this, as it analyzes chatter from Earth: \"It was a whiny culture, we were finding.\""], [0, "Listening to the AI try to reason is also very interesting to my programmers mind."], [0, "I especially loved it's discussion of the meaning of life - it really nails it."], [0, "If a program (or a person) has no objective, it has no purpose, no meaning, no organizing principle, and it's existence will be in trouble."], [0, "But if you have that meaning to organize your thoughts & actions - or your subroutines - than you have a purpose."], [0, "Meaning is the hard problem indeed."], [0, "\"We had a project on this trip back to the solar system, and that project was a labor of love."], [0, "It absorbed all our operations entirely."], [0, "It gave a meaning to our existence."], [0, "And this is a very great gift; this, in the end, is what we think love gives, which is to say meaning."], [0, "Because there is no very obvious meaning to be found in the universe, as far as we can tell."], [0, "But a consciousness that cannot discern a meaning in existence is in trouble, very deep trouble, for at that point there is no organizing principle, no end to the halting problems, no reason to live, no love to be found."], [0, "No: meaning is the hard problem.\""], [1, "My review focuses a lot on the AI, but that's not the main thrust of the book."], [1, "The war between stayers and leavers, the political tensions, the slinghot maneuvers to get back - all make the book worth reading."], [1, "And as a surfer, I love how it ends with Freya finding meaning in surfing waves."]], "rating": 4, "has_spoiler": true, "book_id": "25884323", "review_id": "332732725863131279a8e345b63ac33e"}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "timestamp": "2016-09-20", "review_sentences": [[0, "A beautiful story."], [0, "It is rare to encounter a book that does such a good job painting the scenes in your mind - you really felt like you were there and got to know the characters and the people they came across."], [0, "I generally love WWII books and movies, but wasn't sure if I'd like one featuring a blind girl and a young Nazi radio operator - but he brings a lot of life to them."], [0, "That said, the novel drifts around a lot, and the plotline jumping forward and backward in time drove me nuts."], [0, "I thought a lot about if there is a theme to the book."], [0, "One was the diamond and if it was really cursed (based on the Hope Diamond perhaps?)."], [0, "Another is that 20K Leagues is an awesome book."], [0, "But I think the book was a lot about fear and the unknown, and how people deal with it."], [0, "Marie-Laure was blind and couldn't tell what was happening around her - yet she was the bravest one."], [0, "Werner was afraid of ending up as a miner, which drove him to join the army, and learn about radios."], [0, "And Uncle Etienne was afraid dying from a sniper he couldn't see, so he didn't leave his house and he created a radio transmitter."], [0, "So the moral of the story is... don't be paralyzed by your fears."], [0, "This, she realizes, is the basis of his fear, all fear."], [0, "That a light you are powerless to stop will turn on you and usher a bullet to its mark.\""]], "rating": 4, "has_spoiler": false, "book_id": "19398490", "review_id": "ea4a220b10e6b5c796dae0e3b970aff1"}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "timestamp": "2017-03-22", "review_sentences": [[0, "5 stars for giving me a better framework for how to organize my stuff and what stuff to keep than I'd ever had before."], [0, "For instance it was so freeing to realize I don't have to keep gifts."]], "rating": 5, "has_spoiler": false, "book_id": "22318578", "review_id": "5fe9882bfe4b0520a322820c4c55747d"}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "timestamp": "2015-05-29", "review_sentences": [[0, "Numerous people in publishing have told me this will be the book of the year."]], "rating": 0, "has_spoiler": false, "book_id": "24189224", "review_id": "dbc01e2438df7a87ee3dc16ee23a53e5"}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "timestamp": "2016-12-14", "review_sentences": [[0, "Another hard to put down nonfiction book from Erik Larson."], [0, "I really enjoyed this book - mostly to learn more about submarine warfare in WWI, but also to learn about the history of the time."], [0, "How America entered the war, the importance of shipping to England, the ruthlessness and autonomy of German u-boat commanders."], [0, "Larson also did a great job of layering in interesting historical info (though he overdid it too a little bit)."], [0, "One of the dramas of the story of the Lusitania that Larson focuses on is if the British wanted the Lusitania to be sunk, to help draw America into the war."], [0, "His conclusion seems to be that was the case, though there isn't conclusive evidence."], [0, "Before the Lusitania sank, very few Americans had died in the war, and there were hundreds of Americans on the boat when it sank, which definitely helped change America's attitude."], [0, "And even then, it took 2 years after it sank for America's troops to arrive."], [0, "\"the most likely explanation is that there was indeed a plot, however imperfect, to endanger the Lusitania in order to involve the United States in the war.\""], [0, "Some of my favorite details from the book were simply about what it took to navigate a u-boat in WW1."], [0, "For instance:"], [0, "\"In this day before sonar, a submarine traveled utterly blind, trusting entirely in the accuracy of sea charts."], [0, "One great fear of all U-boat men was that a half-sunk derelict or an uncharted rock might lie in their path.\""], [0, "Which is crazy!"], [0, "Plus, the torpedoes weigh 3 thousand pounds each, so a boat could only carry ~7, and their failure rate was something like 60%."], [0, "Also, they had limited fuel and operated only on batteries when submerged so they could only stay underwater for limited amounts of time."], [0, "Given all this, trying to operate a u-boat to sink other boats is a pretty dangerous sounding game of chess."], [0, "But they certainly had an effect on the war - at one point Britain estimated it would have to surrender in 3 months if it didn't get more supplies."], [0, "There were a lot of interesting details from the era that Larson wove in that was interesting as well."], [0, "Stuff like the fact that Ouija boards were commonplace in American households, straw hat day."], [0, "My main critique is that it had a few too many irrelevant details - about various passengers or what happened the day the boat left dock - and stuff like that - felt a bit padded in that respect."], [0, "But overall, a great read."]], "rating": 4, "has_spoiler": false, "book_id": "22551730", "review_id": "754710070f38e1c59a45f6a85473b836"}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "timestamp": "2016-12-14", "review_sentences": [[0, "I love Stephenson - and this was another hit - absolutely loved it."], [0, "The great thing about a good Stephenson book is it makes you think about the future in new ways, and this book was no exception."], [0, "It was really two books, and I certainly didn't see the second one coming."], [0, "It starts out in modern times and then someone blows up the moon."], [0, "We don't have time to find out who, as within a few years the fragments of the moon cause the worst asteriod shower earth has ever seen and wipe out all life in earth."], [0, "We have time to send 1,500 people up into space - and this is their story."], [0, "The use of robots throughout the books was fascinating to me."], [0, "Stephenson has clearly looked 10-20 years into our future and correctly predicted how it will go."], [0, "From robot workers in space, nano-bots, nano-robot weapons, and more - we get a vivid portrayal of how robots might be a part of our future lives."], [0, "I thought the focus on use of whip technology in space was interesting."], [0, "And of course, the whole notion of Cradle was just cool - though not sure about it's feasibility."]], "rating": 5, "has_spoiler": false, "book_id": "22816087", "review_id": "d11954e6e9e9ddf52aed41d83ce43fa6"}